#Є помилка у функції Фібоначчі. 
#Передбачається, що функція повертає n-те число Фібоначчі, але замість цього вона повертає n-й елемент послідовності Фібоначчі.

#Виправлення

def fibonacci(n):  # Створюємо функцію fibonacci з параметром n (n-те число Фібоначчі)
    fib = [0, 1]  # Ініціалізація масиву чисел Фібоначчі

    for i in range(2, n + 1):
        fib.append(fib[i-1] + fib[i-2])  # Додаємо числа Фібоначчі до масиву

    return fib[n-1]  # Повертаємо n-е число Фібоначчі

n = 10  # Присвоюємо значення змінній n (саме 10те буде = 55)
result = fibonacci(n)  # Виклик функції Фібоначчі з n як аргумент
print(result)  # Результат