def fibonacci(n):  # Створюємо функцію fibonacci з параметром n (n-те число Фібоначчі)
    fib = [0, 1]  # Ініціалізація масиву чисел Фібоначчі

    for i in range(2, n + 1):
        fib.append(fib[i-1] + fib[i-2])  # Додаємо числа Фібоначчі до масиву

    return fib[n]  # Повертаємо n-е число Фібоначчі

n = 10  # Присвоюємо значення змінній n (саме 10те буде = 55)
result = fibonacci(n)  # Виклик функції Фібоначчі з n як аргумент
print(result)  # Результат. Алгоритм працює правильно

#Функція fibonacci приймає параметр n, що відповідає позиції числа Фібоначчі, 
#яке потрібно обчислити, потім динамічно зберігаємо проміжні результати обчислення чисел Фібоначчі у масиві fib. 
#В кінці повертаємо значення в n-ій позиції масиву, яке відповідає n-му числу Фібоначчі.
# Масив тут для збереження проміжних результатів обчислення, щоб уникнути зайвого повторного обчислення тих самих значень 

#проект коміту